ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M261/device/M261.h
#define ACMP01              ((ACMP_T *) ACMP01_BASE)                    /*!< ACMP01 Pointer                      */

#define CLK                 ((CLK_T *) CLK_BASE)                        /*!< System Clock Controller Pointer     */

#define DAC0                ((DAC_T *) DAC0_BASE)                       /*!< DAC0 Pointer                        */
#define DAC1                ((DAC_T *) DAC1_BASE)                       /*!< DAC1 Pointer                        */

#define EADC                ((EADC_T *) EADC_BASE)                      /*!< EADC Pointer                        */

#define SYS                 ((SYS_T *) SYS_BASE)                        /*!< System Global Controller Pointer    */

#define SYSINT              ((SYS_INT_T *) INT_BASE)                    /*!< Interrupt Source Controller Pointer */

#define FMC                 ((FMC_T *) FMC_BASE)                        /*!< Flash Memory Controller */

#define SDH0                    ((SDH_T *)   SDH0_BASE)

#define CRPT                ((CRPT_T *) CRPT_BASE)                      /*!< Crypto Accelerator Pointer          */
#define TRNG                ((TRNG_T *)TRNG_BASE)                       /*!< True Random Number Pointer          */

#define BPWM0               ((BPWM_T *) BPWM0_BASE)                     /*!< BPWM0 Pointer                       */
#define BPWM1               ((BPWM_T *) BPWM1_BASE)                     /*!< BPWM1 Pointer                       */

#define EPWM0               ((EPWM_T *) EPWM0_BASE)                     /*!< EPWM0 Pointer                       */
#define EPWM1               ((EPWM_T *) EPWM1_BASE)                     /*!< EPWM1 Pointer                       */

#define SC0                 ((SC_T *) SC0_BASE)                         /*!< SC0 Pointer                         */
#define SC1                 ((SC_T *) SC1_BASE)                         /*!< SC1 Pointer                         */
#define SC2                 ((SC_T *) SC2_BASE)                         /*!< SC2 Pointer                         */

#define EBI                 ((EBI_T *) EBI_BASE)                        /*!< EBI Pointer                         */

#define CRC                 ((CRC_T *) CRC_BASE)                        /*!< CRC Pointer                         */

#define USBD                ((USBD_T *) USBD_BASE)                      /*!< USB Device Pointer                  */
#define USBH                ((USBH_T *) USBH_BASE)                      /*!< USBH Pointer                        */
#define OTG                 ((OTG_T *) OTG_BASE)                        /*!< OTG Pointer                         */

#define PDMA0               ((PDMA_T *) PDMA0_BASE)                     /*!< PDMA0 Pointer                        */
#define PDMA1               ((PDMA_T *) PDMA1_BASE)                     /*!< PDMA1 Pointer                        */

#define UI2C0               ((UI2C_T *) USCI0_BASE)                     /*!< UI2C0 Pointer                       */
#define UI2C1               ((UI2C_T *) USCI1_BASE)                     /*!< UI2C1 Pointer                       */
#define UI2C2               ((UI2C_T *) USCI2_BASE)                     /*!< UI2C2 Pointer                       */

#define USPI0               ((USPI_T *) USCI0_BASE)                     /*!< USPI0 Pointer                       */
#define USPI1               ((USPI_T *) USCI1_BASE)                     /*!< USPI1 Pointer                       */

#define UUART0              ((UUART_T *) USCI0_BASE)                    /*!< UUART0 Pointer                      */
#define UUART1              ((UUART_T *) USCI1_BASE)                    /*!< UUART1 Pointer                      */

#define SCU                 ((SCU_T *) SCU_BASE)                        /*!< SCU Pointer                         */
#define ECAP0               ((ECAP_T *) ECAP0_BASE)                     /*!< ECAP0 Pointer                       */
#define ECAP1               ((ECAP_T *) ECAP1_BASE)                     /*!< ECAP1 Pointer                       */

#define CAN0                ((CAN_T *)CAN0_BASE)                        /*!< CAN0 Pointer                        */


/**@}*/ /* end of group PMODULE */

/* --------------------  End of section using anonymous unions  ------------------- */
#if   defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
/* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

#ifdef __cplusplus
}
#endif


/*=============================================================================*/
typedef volatile unsigned char  vu8;
typedef volatile unsigned long  vu32;
typedef volatile unsigned short vu16;
#define M8(adr)  (*((vu8  *) (adr)))
#define M16(adr) (*((vu16 *) (adr)))
#define M32(adr) (*((vu32 *) (adr)))

#define outpw(port,value)   (*((volatile unsigned int *)(port))=(value))
#define inpw(port)          ((*((volatile unsigned int *)(port))))
#define outpb(port,value)   (*((volatile unsigned char *)(port))=(value))
#define inpb(port)          ((*((volatile unsigned char *)(port))))
#define outps(port,value)   (*((volatile unsigned short *)(port))=(value))
#define inps(port)          ((*((volatile unsigned short *)(port))))

#define outp32(port,value)  (*((volatile unsigned int *)(port))=(value))
#define inp32(port)         ((*((volatile unsigned int *)(port))))
#define outp8(port,value)   (*((volatile unsigned char *)(port))=(value))
#define inp8(port)          ((*((volatile unsigned char *)(port))))
#define outp16(port,value)  (*((volatile unsigned short *)(port))=(value))
#define inp16(port)         ((*((volatile unsigned short *)(port))))


#define E_SUCCESS   0

#define TRUE        (1L)
#define FALSE       (0L)

#define ENABLE      1
#define DISABLE     0

/* Bit Mask Definitions */
#define BIT0    0x00000001UL
#define BIT1    0x00000002UL
#define BIT2    0x00000004UL
#define BIT3    0x00000008UL
#define BIT4    0x00000010UL
#define BIT5    0x00000020UL
#define BIT6    0x00000040UL
#define BIT7    0x00000080UL
#define BIT8    0x00000100UL
#define BIT9    0x00000200UL
#define BIT10   0x00000400UL
#define BIT11   0x00000800UL
#define BIT12   0x00001000UL
#define BIT13   0x00002000UL
#define BIT14   0x00004000UL
#define BIT15   0x00008000UL
#define BIT16   0x00010000UL
#define BIT17   0x00020000UL
#define BIT18   0x00040000UL
#define BIT19   0x00080000UL
#define BIT20   0x00100000UL
#define BIT21   0x00200000UL
#define BIT22   0x00400000UL
#define BIT23   0x00800000UL
#define BIT24   0x01000000UL
#define BIT25   0x02000000UL
#define BIT26   0x04000000UL
#define BIT27   0x08000000UL
#define BIT28   0x10000000UL
#define BIT29   0x20000000UL
#define BIT30   0x40000000UL
#define BIT31   0x80000000UL


/* Byte Mask Definitions */
#define BYTE0_Msk               (0x000000FFUL)
#define BYTE1_Msk               (0x0000FF00UL)
#define BYTE2_Msk               (0x00FF0000UL)
#define BYTE3_Msk               (0xFF000000UL)

#define _GET_BYTE0(u32Param)    (((u32Param) & BYTE0_Msk)        )  /*!< Extract Byte 0 (Bit  0~ 7) from parameter u32Param */
#define _GET_BYTE1(u32Param)    (((u32Param) & BYTE1_Msk) >>  8UL)  /*!< Extract Byte 1 (Bit  8~15) from parameter u32Param */
#define _GET_BYTE2(u32Param)    (((u32Param) & BYTE2_Msk) >> 16UL)  /*!< Extract Byte 2 (Bit 16~23) from parameter u32Param */
#define _GET_BYTE3(u32Param)    (((u32Param) & BYTE3_Msk) >> 24UL)  /*!< Extract Byte 3 (Bit 24~31) from parameter u32Param */


/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/
#include "m261_sys.h"
#include "m261_clk.h"
#include "m261_dac.h"
#include "m261_eadc.h"
#include "m261_ebi.h"
#include "m261_ecap.h"
#include "m261_fmc.h"
#include "m261_gpio.h"
#include "m261_i2c.h"
#include "m261_i2s.h"
#include "m261_bpwm.h"
#include "m261_epwm.h"
#include "m261_qspi.h"
#include "m261_spi.h"
#include "m261_timer.h"
#include "m261_timer_pwm.h"
#include "m261_wdt.h"
#include "m261_wwdt.h"
#include "m261_rtc.h"
#include "m261_uart.h"
#include "m261_acmp.h"
#include "m261_crc.h"
#include "m261_usbd.h"
#include "m261_otg.h"
#include "m261_pdma.h"
#include "m261_ebi.h"
#include "m261_crypto.h"
#include "m261_sc.h"
#include "m261_scuart.h"
#include "m261_usci_spi.h"
#include "m261_usci_uart.h"
#include "m261_usci_i2c.h"
#include "m261_sdh.h"
#include "m261_qei.h"
#include "m261_can.h"
#include "m261_scu.h"

#endif  /* __M261_H__ */


/* Copyright (C) 2019 Nuvoton Technology Corp. All rights reserved. */

